// nav
const navData = [
    {title:"PICK UP", link:"#pickup"},
    {title:"FEATURE", link:"#feature"},
    {title:"CONTACT", link:"#contact"},
]

// sns
const snsData = [
    {title:"Twitter", link:""},
    {title:"facebook", link:""},
    {title:"instagram", link:""},
]

// Pickup

const pickupData = [
  {image:"pickup1.jpg", alt:"青い橋の上で靴を手に持つ瞬間。靴紐が結ばれ、シャボン玉がふんわり漂う。"},
  {image:"pickup2.jpg", alt:"玄関マットの上に円形に並べられたカラフルなスニーカー。中央のマットには『PLEASE REMOVE YOUR YEEZYS』の文字が描かれている。"},
  {image:"pickup3.jpg", alt:"壁に取り付けられた棚に整然と陳列されたスニーカーコレクション。さまざまなデザインの靴が並び、店舗ディスプレイのような印象。"},
  {image:"pickup4.jpg", alt:"屋外の岩の上で履かれたグレーとオレンジのスニーカー。背景には自然がぼんやりと映る。"},
  {image:"pickup5.jpg", alt:"屋内の光沢のある赤い床の上で履かれた赤と白のスニーカー。背景も赤一色で統一されている。"},
  {image:"pickup6.jpg", alt:"座った状態で足を組み、黄色と黒のスニーカーを強調したポーズ。"},
  {image:"pickup7.jpg", alt:"コンクリートの上に置かれた星条旗柄のハイカットスニーカー。側面に『LAUNCH』の文字がプリントされ、夜間の屋外で撮影されている。"},
  {image:"pickup8.jpg", alt:"棚に並べられた白いスニーカーのコレクション。赤いハートや目のデザインが施され、背景にも大きな赤い目のモチーフが配置されている。"},
  {image:"pickup9.jpg", alt:"白地に赤と青のアクセントが入ったスニーカーを履いた足のクローズアップ。背景には赤いバナーと白い文字が映り込み、ブランドやイベントを示唆している。"}
]
// feature
const featureData = [
    {image:"feature1.jpg", alt:"赤い照明のステージ上で履かれたReebokの白いスニーカーと白い靴下のクローズアップ。", text:"青いライトの下で映えるホワイトスニーカー。洗練されたシンプルデザイン × 圧倒的な快適性。"},
    {image:"feature2.jpg", alt:"木製の床を背景に、手に持たれたNikeのオレンジ・白・黒のスニーカー。デザインの細部が際立つ。", text:"洗練されたカラーブロックデザインスタイルと機能性を兼ね備えた究極のスニーカー。"},
    {image:"feature3.jpg", alt:"黄色の背景に映える緑色のスニーカー。履いた足にはタトゥーがあり、黒色の靴紐が特徴。", text:"クラシック × 鮮やかなグリーン × 独自のスタイルどんなシーンでも目を引く存在感抜群の一足。"},
    {image:"feature4.jpg", alt:"ピンクと紫のアクセントが入った白いNike Airスニーカーのクローズアップ。カラフルな模様のある表面に置かれている。", text:"クラシック × トレンドカラー大胆なピンクとブルーが映える、唯一無二のスタイル。"},
    {image:"feature5.jpg", alt:"濡れた路面の上で水しぶきを上げながら履かれるオリーブグリーンのハイカットNikeスニーカー。黄色のソールが特徴的。", text:"水たまりさえも楽しめるグリップ力！街歩きでもアウトドアでも快適な履き心地。"},
    {image:"feature6.jpg", alt:"暗い環境で水たまりに踏み込む白いNikeスニーカー。水しぶきが勢いよく飛び散っている。", text:"どんな瞬間もドラマチックに。都会を駆け抜けるためのハイカットスニーカー。"},
    {image:"feature7.jpg", alt:"赤い照明のステージ上で履かれたReebokの白いスニーカーと白い靴下のクローズアップ。", text:"ブラック × ホワイトの完璧なバランス都会の夜に映えるアイコニックなデザイン。"},
    {image:"feature8.jpg", alt:"灰色のコンクリートの上に置かれた白いハイカットNikeスニーカー。クリーンなデザインが特徴。", text:"細部にまでこだわった洗練のシルエット、どんなスタイルにも合わせやすい万能スニーカー。"},
    {image:"feature9.jpg", alt:"白い背景の上に置かれた黒いスポーツシューズ。ソールに緑のアクセントが入ったスタイリッシュなデザイン。", text:"抜群のフィット感とグリップ力どんな環境でも安心して履けるハイカットスニーカー。"},
]

module.exports = { navData, snsData, pickupData, featureData };